app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "authors" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "authors"."id" = ?
---
  def update
    @author = Author.find(params[:id])
    @author.update(author_params)

INSERT INTO "authors" ("bio", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["bio", "man"], ["name", "Test"], ["created_at", "2016-02-06 16:07:10.399317"], ["updated_at", "2016-02-06 16:07:10.399317"]]
---
  def create
    @author = Author.create(author_params)